## Plan Result (stg_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 237 to add, 0 to change, 237 to destroy.</code></pre>

* Create
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door.azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]
* Delete
  * module.premium_front_door[0].azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;c100-application&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;portal-stg&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-casetracker&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-courtfines&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-admin-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-care-standards&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-cicap&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-employment-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-finance-tax&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-immigration-svcs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-info-rights&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-land-reg-division&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-lands-chamber&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;staging-trib-tansport-appeals&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be created
  + resource "azapi_update_resource" "frontdoor_system_identity" {
      + body                    = jsonencode(
            {
              + identity = {
                  + type = "SystemAssigned"
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + response_export_values  = [
          + "identity.principalId",
          + "identity.tenantId",
        ]
      + type                    = "Microsoft.Cdn/profiles@2023-02-01-preview"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "c100-application.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "c100-application"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "darts-portal.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "darts-portal"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "pip-frontend.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pip-frontend"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "sign-in.pip-frontend.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pip-frontend-b2c-sign-in"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staff.pip-frontend.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pip-frontend-b2c-staff"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["portal-stg"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "portal-stg.pre-recorded-evidence.justice.gov.uk"
      + id                       = (known after apply)
      + name                     = "portal-stg"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "pre-portal.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pre-portal"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "sds-api-mgmt.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "sds-api-mgmt"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-casetracker"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.casetracker.justice.gov.uk"
      + id                       = (known after apply)
      + name                     = "staging-casetracker"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-certificatedbailiffs"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.certificatedbailiffs.justice.gov.uk"
      + id                       = (known after apply)
      + name                     = "staging-certificatedbailiffs"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-courtfines"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.courtfines.direct.gov.uk"
      + id                       = (known after apply)
      + name                     = "staging-courtfines"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-immigrationappealsonline"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.immigrationappealsonline.justice.gov.uk"
      + id                       = (known after apply)
      + name                     = "staging-immigrationappealsonline"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-admin-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.administrativeappeals.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-admin-appeals"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-care-standards"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.carestandards.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-care-standards"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-cicap"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.cicap.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-cicap"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-employment-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.employmentappeals.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-employment-appeals"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-finance-tax"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.financeandtax.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-finance-tax"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-immigration-svcs"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.immigrationservices.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-immigration-svcs"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-info-rights"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.informationrights.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-info-rights"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-land-reg-division"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.landregistrationdivision.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-land-reg-division"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-lands-chamber"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.landschamber.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-lands-chamber"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["staging-trib-tansport-appeals"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "staging.transportappeals.dsd.io"
      + id                       = (known after apply)
      + name                     = "staging-trib-tansport-appeals"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "toffee.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "toffee"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "admin.staging.hearings.reform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-admin-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "video.staging.hearings.reform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-video-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["c100-application"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

4dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtribfinancetaxstgPremium-securityPolicy" -> null
      - name                     = "stagingtribfinancetaxstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribfinancetaxstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-finance-tax" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["staging-trib-immigration-svcs"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtribimmigrationsvcsstgPremium-securityPolicy" -> null
      - name                     = "stagingtribimmigrationsvcsstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribimmigrationsvcsstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-immigration-svcs" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["staging-trib-info-rights"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtribinforightsstgPremium-securityPolicy" -> null
      - name                     = "stagingtribinforightsstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribinforightsstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-info-rights" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["staging-trib-land-reg-division"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtriblandregdivisionstgPremium-securityPolicy" -> null
      - name                     = "stagingtriblandregdivisionstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtriblandregdivisionstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-land-reg-division" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["staging-trib-lands-chamber"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtriblandschamberstgPremium-securityPolicy" -> null
      - name                     = "stagingtriblandschamberstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtriblandschamberstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-lands-chamber" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["staging-trib-tansport-appeals"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/stagingtribtansportappealsstgPremium-securityPolicy" -> null
      - name                     = "stagingtribtansportappealsstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribtansportappealsstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/staging-trib-tansport-appeals" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["toffee"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/toffeestgPremium-securityPolicy" -> null
      - name                     = "toffeestgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeestgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/toffee" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-admin-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/vhadminwebstgPremium-securityPolicy" -> null
      - name                     = "vhadminwebstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/vh-admin-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-video-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null
      - id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/securityPolicies/vhvideowebstgPremium-securityPolicy" -> null
      - name                     = "vhvideowebstgPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebstgPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/customDomains/vh-video-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg/objectId/141eaae2-731b-4181-8d78-1b427b788a15" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg" -> null
      - object_id               = "141eaae2-731b-4181-8d78-1b427b788a15" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      - id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg|fd-log-analytics-logs-sa" -> null
      - name               = "fd-log-analytics-logs-sa" -> null
      - storage_account_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Storage/storageAccounts/hmctssdsdiagstg" -> null
      - target_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null

      - enabled_log {
          - category = "FrontdoorAccessLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorWebApplicationFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      - id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg|fd-log-analytics" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "fd-log-analytics" -> null
      - target_resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg" -> null

      - enabled_log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg/providers/Microsoft.Authorization/roleAssignments/99dc66a2-61d4-e56e-69ff-07d4830f6476" -> null
      - name                 = "99dc66a2-61d4-e56e-69ff-07d4830f6476" -> null
      - principal_id         = "141eaae2-731b-4181-8d78-1b427b788a15" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsstg" -> null
    }

Plan: 237 to add, 0 to change, 237 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":611,"Program":"tfcmt","SHA1":"","Target":"stg_frontdoor","Vars":{}} -->